# pandas
two type -> series and data frame


series -> 1d array object

data frame -> 2d array object

In [4]:
import pandas as pd

In [2]:
data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
data={'a':1,'b':2,'c':3}
seriesDic=pd.Series(data)
print(seriesDic)

a    1
b    2
c    3
dtype: int64

In [4]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [5]:
# data frame
# from dictionary

data={
    'Name':['Divyansh','Mishu','Krish'],
    'Age':[20,30,40],
    'City':['Alwar','Kishangarh','Delhi']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

       Name  Age        City
0  Divyansh   20       Alwar
1     Mishu   30  Kishangarh
2     Krish   40       Delhi
<class 'pandas.core.frame.DataFrame'>

In [14]:
# create a data frame from a list of dictionaries
data=[
    {'Name':'Krish','Age':20,'City':'Delhi'},
    {'Name':'Divyansh','Age':30,'City':'Jaipur'},
    {'Name':'Mishu','Age':40,'City':'Alwar'},
    {'Name':'Singhal','Age':50,'City':'Bharatpur'},
]
df=pd.DataFrame(data)
print(df)

       Name  Age       City
0     Krish   20      Delhi
1  Divyansh   30     Jaipur
2     Mishu   40      Alwar
3   Singhal   50  Bharatpur

In [12]:
df=pd.read_csv('sales_data.csv')
print(df.head(5))

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [17]:
data

{'Name': ['Divyansh', 'Mishu', 'Krish'],
 'Age': [20, 30, 40],
 'City': ['Alwar', 'Kishangarh', 'Delhi']}

In [18]:
df

       Name  Age        City
0  Divyansh   20       Alwar
1     Mishu   30  Kishangarh
2     Krish   40       Delhi

In [19]:
df['Name']

0    Divyansh
1       Mishu
2       Krish
Name: Name, dtype: object

In [20]:
df.loc[0]

Name    Divyansh
Age           20
City       Alwar
Name: 0, dtype: object

In [29]:
df.iloc[0]

Name    Divyansh
Age           20
City       Alwar
Name: 0, dtype: object

In [30]:
# Accessing a specified element

df['Name']

0    Divyansh
1       Mishu
2       Krish
Name: Name, dtype: object

In [31]:
df

       Name  Age        City
0  Divyansh   20       Alwar
1     Mishu   30  Kishangarh
2     Krish   40       Delhi

In [32]:
df.at[2,'City']

'Delhi'

In [33]:
# accessifying a specified element using iat

df.iat[2,2]

'Delhi'

In [34]:
# data manipulation with data frames

df

       Name  Age        City
0  Divyansh   20       Alwar
1     Mishu   30  Kishangarh
2     Krish   40       Delhi

In [9]:
df['Salary']=[5,10,15]

In [11]:
df

       Name  Age        City  Salary
0  Divyansh   20       Alwar       5
1     Mishu   30  Kishangarh      10
2     Krish   40       Delhi      15

In [10]:
# remove a column
df.drop('Salary',axis=1) # temporary operation

       Name  Age        City
0  Divyansh   20       Alwar
1     Mishu   30  Kishangarh
2     Krish   40       Delhi

In [12]:
df

       Name  Age        City  Salary
0  Divyansh   20       Alwar       5
1     Mishu   30  Kishangarh      10
2     Krish   40       Delhi      15

In [13]:
df.drop('Salary',axis=1,inplace=True)

In [14]:
df

       Name  Age        City
0  Divyansh   20       Alwar
1     Mishu   30  Kishangarh
2     Krish   40       Delhi

In [15]:
df.drop(0)

    Name  Age        City
1  Mishu   30  Kishangarh
2  Krish   40       Delhi

In [16]:
df

       Name  Age        City
0  Divyansh   20       Alwar
1     Mishu   30  Kishangarh
2     Krish   40       Delhi

In [17]:
df.drop(0,inplace=True)

In [18]:
df

    Name  Age        City
1  Mishu   30  Kishangarh
2  Krish   40       Delhi

In [19]:
df.describe()

             Age
count   2.000000
mean   35.000000
std     7.071068
min    30.000000
25%    32.500000
50%    35.000000
75%    37.500000
max    40.000000